# Question 1
###### Consider the following Python module

In [72]:
a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2

In [73]:
b()
b()
b()

In [74]:
print(a)

6

A value is 6 because as A is a global variable and we can change modify global variable inside a function. As we can see that in function b global a is defined to change the value, the function c will return addition to 2 with the number we pass in the function. So here we have called b function 3 times so the value is getting add everytime while c function is called in b. So at first time the value of a will be 0 then it will change to 2, in second iteration the value will change to 4 and in the final call of b it will be 6 (Addition of 2)

### Question 2
###### Function fileLength(), given to you, takes the name of a file as input and returns the length of the file:

In [75]:
def file_length(file_name):
    try:
        file = open(file_name)
        contents = file.read()
        file.close()
        print(len(contents))
    except:
        print(f"File {file_name} not found.")

In [76]:
file_length("midTerm.py")

29

In [77]:
file_length("idterm.py")

File idterm.py not found.

In [78]:
file_length("hello.py")

File hello.py not found.

### Question 3
###### Write a class named Marsupial that can be used as shown below:

In [79]:
class Marsupial:
    def __init__(self):
        self.data = []

    def put_in_pouch(self, app):
        self.data.append(app)
        
    
    def pouch_contents(self):
        print(self.data)

In [80]:
m = Marsupial()

m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
m.put_in_pouch('test data')
m.put_in_pouch("rahin")

In [81]:
m.pouch_contents()

['doll', 'firetruck', 'kitten', 'test data', 'rahin']

In [82]:
class Kangaroo(Marsupial):
    
    def __init__(self,x,y):
        super().__init__()
        self.coordinates = (x,y)
        print(f'I am a Kangaroo located at coordinates {self.coordinates}')
     
    def jump(self,x,y):
        last_coordinates = self.coordinates
        self.coordinates = (last_coordinates[0] + x,last_coordinates[1] + y)
        print(self.coordinates)
    
    def __str__(self):
        return str(self.coordinates)

In [83]:
k = Kangaroo(0,0)

I am a Kangaroo located at coordinates (0, 0)

In [84]:
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
k.pouch_contents()

['doll', 'firetruck', 'kitten']

In [85]:
k.jump(1,0)
# k.jump(1,0)
# k.jump(1,0)

(1, 0)

In [86]:
k.jump(2,3)

(3, 3)

In [87]:
print(k)

(3, 3)

# Question 4
###### Write function collatz() that takes a positive integer x as input and prints the Collatz sequence starting at x

In [88]:
def collatz(x):
    print(x)
    if x == 1:
        return x
    else:
        if (x % 2) == 0:
            x = x // 2
        else:
            x = (3*(x)) + 1
        return collatz(x)

In [89]:
collatz(10)

10
5
16
8
4
2
1

1

In [90]:
collatz(1)

1

1

## Question 5
###### Write a recursive method binary() that takes a non-negative integer n and prints the binary representation of integer n.

In [13]:
# In python we have Formatting Types one of them is :b that is used to convert int to Binary format"

def binary(n):
        txt = "{0:b}"
        print(txt.format(int(n)))

In [14]:
binary(0)

0

In [15]:
binary(1)

1

In [16]:
binary(3)

11

In [17]:
binary(9)

1001

## Question 6
##### Implement a class named HeadingParser

In [71]:
from html.parser import HTMLParser

class HeadingParser(HTMLParser):
    inHeadingH1 = False
    inHeadingH2 = False
    def handle_starttag(self, tag, attrs):
        if tag == "h1":
            self.inHeadingH1 = True
        if tag == "h2":
            self.inHeadingH2 = True
            
    def handle_data(self, data):
        if self.inHeadingH1 or self.inHeadingH2:
            print(data)
    
    def handle_endtag(self, tag):
        if tag =="h1":
            self.inHeadingH1 = False
        if tag == "h2":
            self.inHeadingH2 = False

hp = HeadingParser()
file = open("w3c.html", "r")
html = file.read()
file.close()
hp.feed(html)

W3C Mission
Principles

## Question 9
###### Write list comprehension expressions that use list words and generate the following lists

In [124]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']

UpperCase = list(map(lambda x: x.upper(), words))
LowerCase = list(map(lambda x: x.lower(), words))
LengthOfWord = list(map(lambda x: len(x), words))

def convertToTypes(x):
    return [x.upper(),x.lower(),len(x)]

List1 = list(map(lambda x: convertToTypes(x), words))
List2 = list(filter(lambda x: (x,False)[len(x) < 4], words))

In [125]:
print(UpperCase,"\n")
print(LowerCase,"\n")
print(LengthOfWord,"\n")
print(List1,"\n")
print(List2,"\n")

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

[3, 5, 5, 3, 5, 4, 3, 4, 3]

[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]

['quick', 'brown', 'jumps', 'over', 'lazy']

## Question 7
### Implement recursive function webdir()

In [67]:
from urllib.parse import urljoin
from html.parser import HTMLParser
class Collector(HTMLParser):
    'collects hyperlink URLs into a list'

    def __init__(self, url):
        'initializes parser, the url, and a list'
        HTMLParser.__init__(self)
        self.url = url
        self.links = []

    
    def handle_starttag(self, tag, attrs):
        'collects hyperlink URLs in their absolute format'
        if tag == 'a':
            for attr in attrs:
                if attr[0] == 'href':
                    # construct absolute URL
                    absolute = urljoin(self.url, attr[1])
                    if absolute[:4] == 'http': # collect HTTP URLs
                        self.links.append(absolute)
                        
    def getLinks(self):
        'returns hyperlinks URLs in their absolute format'
        return self.links

In [68]:
visited = set() # initialize visited to an empty set

def webdir(url,depth,indent):
    '''a recursive web crawler that calls analyze()
       on every visited web page'''

    # add url to set of visited pages
    global visited     # warns the programmer 
    visited.add(url)

    # analyze() returns a list of hyperlink URLs in web page url 
    links = analyze(url)

    # recursively continue crawl from every link in links
    for link in links:
        # follow link only if not visited
        if link not in visited:
            try:
                webdir(link)
            except:
                pass

In [69]:
from urllib.request import urlopen
from urllib.parse import urljoin

from html.parser import HTMLParser

def analyze(url):
    
    print('\n\nVisiting', url)           # for testing

    # obtain links in the web page
    content = urlopen(url).read().decode()
    collector = Collector(url)
    collector.feed(content)
    urls = collector.getLinks()          # get list of links

    # print the http links found in web page
    print('\n{:45} {:10}'.format('URL', 'link'))
    for link in urls:
        print('{:45} {:10}'.format(url, link))

    return urls

In [70]:
webdir("http://reed.cs.depaul.edu/lperkovic/test1.html",1,2)

Visiting http://reed.cs.depaul.edu/lperkovic/test1.html

URL                                           link
http://reed.cs.depaul.edu/lperkovic/test1.html http://reed.cs.depaul.edu/lperkovic/test2.html
http://reed.cs.depaul.edu/lperkovic/test1.html http://reed.cs.depaul.edu/lperkovic/test3.html

## Question 8
##### Write SQL queries on the below database table that return

In [2]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\programdata\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: prettytable<1 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython>=1.0 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: six in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.4.22)
Requirement already satisfied: jedi>=0.16 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: colorama in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: setuptools>=18.5 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: pygments in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: pickleshare in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: matplotlib-inline in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: backcall in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=4.2 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: decorator in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\programdata\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\programdata\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)

In [2]:
%%sql
CREATE TABLE CITYRECORDS(city varchar(50),country varchar(50),Season varchar(50),Temperature float,Rainfall float);

UsageError: Cell magic `%%sql` not found.

In [2]:
pip install --user --upgrade ipython-sql

Requirement already satisfied: ipython-sql in c:\programdata\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: six in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.4.22)
Requirement already satisfied: sqlparse in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: ipython>=1.0 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: backcall in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: matplotlib-inline in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: pickleshare in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.16 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: decorator in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: pygments in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: traitlets>=4.2 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: setuptools>=18.5 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\programdata\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\programdata\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Note: you may need to restart the kernel to use updated packages.

In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [8]:
%%sql
CREATE TABLE CITYRECORDS(city varchar(50),country varchar(50),Season varchar(50),Temperature float,Rainfall float);

 * sqlite://
Done.

[]

In [7]:
%sql sqlite://

In [12]:
%sql SELECT * from CITYRECORDS;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9)]

In [11]:
%sql INSERT INTO CITYRECORDS VALUES('Mumbai','India','Winter',24.8,5.9);

 * sqlite://
1 rows affected.

[]

In [17]:
%sql INSERT INTO CITYRECORDS (city, country, Season,Temperature,Rainfall) VALUES ('Mumbai', 'India','Spring',28.4,16.9),('Mumbai', 'India', 'Summer',27.9,1549.4)

 * sqlite://
2 rows affected.

[]

In [18]:
%sql SELECT * from CITYRECORDS;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.9),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4)]

In [19]:
%sql INSERT INTO CITYRECORDS (city, country, Season,Temperature,Rainfall) VALUES ('Mumbai', 'India','Fall',27.6,346.0),('London', 'United Kingdom', 'Winter',4.2,207.7),('London','United Kingdom','Spring',8.3,169.6),('London','United Kingdom','Summer',15.7,157.0),('London','United Kingdom','Fall',10.4,218.5)

 * sqlite://
5 rows affected.

[]

In [20]:
%sql SELECT * from CITYRECORDS;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.9),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5)]

In [21]:
%sql INSERT INTO CITYRECORDS (city, country, Season,Temperature,Rainfall) VALUES ('Cairo', 'Egypt','Winter',13.6,16.5),('Cairo', 'Egypt', 'Spring',20.7,6.5),('Cairo','Egypt','Summer',27.7,0.1),('Cairo','Egypt','Fall',22.2,4.5)

 * sqlite://
4 rows affected.

[]

###### All the temperature data

In [23]:
%sql SELECT * from CITYRECORDS;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.9),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

###### All the cities, but without repetition

In [25]:
%sql SELECT DISTINCT city FROM CITYRECORDS;

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',)]

###### All the records for India.

In [33]:
%sql SELECT * FROM CITYRECORDS WHERE country = 'India'

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.9),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0)]

###### All the Fall records.

In [34]:
%sql SELECT * FROM CITYRECORDS WHERE Season = 'Fall'

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

###### The city, country, and season for which the average rainfall is between 200 and 400 millimeters.

In [36]:
%sql SELECT city,country,Season,Rainfall FROM CITYRECORDS WHERE Rainfall BETWEEN 200.0 AND 400.0

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 346.0),
 ('London', 'United Kingdom', 'Winter', 207.7),
 ('London', 'United Kingdom', 'Fall', 218.5)]

###### The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order

In [40]:
%sql SELECT city,country,Season,Temperature FROM CITYRECORDS WHERE Temperature > 20.0

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8),
 ('Mumbai', 'India', 'Spring', 28.4),
 ('Mumbai', 'India', 'Summer', 27.9),
 ('Mumbai', 'India', 'Fall', 27.6),
 ('Cairo', 'Egypt', 'Spring', 20.7),
 ('Cairo', 'Egypt', 'Summer', 27.7),
 ('Cairo', 'Egypt', 'Fall', 22.2)]

###### The total annual rainfall for Cairo

In [49]:
%sql SELECT SUM(Rainfall) AS 'Total' FROM CITYRECORDS WHERE city = 'Cairo'

 * sqlite://
Done.

[(27.6,)]

###### The total rainfall for each season.

In [58]:
%sql SELECT DISTINCT Season, sum(Rainfall) AS 'TotalRainFall' FROM CITYRECORDS GROUP BY Season

 * sqlite://
Done.

[('Fall', 569.0), ('Spring', 193.0), ('Summer', 1706.5), ('Winter', 230.1)]